# CurveByPointsArrayIterator Properties

---
The CurveByPointsArrayIterator type exposes the following members.
| Name| Description
---|---|---
| Current| Retrieves the item that is the current focus of the iterator.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
Top
#### Reference
CurveByPointsArrayIterator Class
Autodesk.Revit.DB Namespace